sysbenchOutputs/results_32_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      192.84
    writes/s:                     128.87
    fsyncs/s:                     537.18

Throughput:
    read, MiB/s:                  3.01
    written, MiB/s:               2.01

General statistics:
    total time:                          32.0131s
    total number of events:              23402

Latency (ms):
         min:                                    0.00
         avg:                                   41.15
         max:                                  591.46
         95th percentile:                      170.48
         sum:                               962926.23

Threads fairness:
    events (avg/stddev):           731.3125/79.03
    execution time (avg/stddev):   30.0914/0.06