sysbenchOutputs/results_36_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 36
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 800KiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      289.47
    writes/s:                     192.92
    fsyncs/s:                     767.37

Throughput:
    read, MiB/s:                  4.52
    written, MiB/s:               3.01

General statistics:
    total time:                          30.2627s
    total number of events:              33217

Latency (ms):
         min:                                    0.00
         avg:                                   32.55
         max:                                  338.22
         95th percentile:                      139.85
         sum:                              1081123.05

Threads fairness:
    events (avg/stddev):           922.6944/88.91
    execution time (avg/stddev):   30.0312/0.00