sysbenchOutputs/results_37_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 37
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 8MiB each
1GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      262.99
    writes/s:                     175.38
    fsyncs/s:                     714.58

Throughput:
    read, MiB/s:                  4.11
    written, MiB/s:               2.74

General statistics:
    total time:                          30.3360s
    total number of events:              30244

Latency (ms):
         min:                                    0.00
         avg:                                   36.73
         max:                                  356.58
         95th percentile:                      155.80
         sum:                              1110846.94

Threads fairness:
    events (avg/stddev):           817.4054/77.58
    execution time (avg/stddev):   30.0229/0.02