sysbenchOutputs/results_38_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 38
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 800KiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      285.25
    writes/s:                     190.39
    fsyncs/s:                     765.62

Throughput:
    read, MiB/s:                  4.46
    written, MiB/s:               2.97

General statistics:
    total time:                          30.4817s
    total number of events:              32976

Latency (ms):
         min:                                    0.00
         avg:                                   34.62
         max:                                  296.06
         95th percentile:                      147.61
         sum:                              1141623.01

Threads fairness:
    events (avg/stddev):           867.7895/86.25
    execution time (avg/stddev):   30.0427/0.02