sysbenchOutputs/results_39_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 39
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      269.27
    writes/s:                     179.68
    fsyncs/s:                     737.27

Throughput:
    read, MiB/s:                  4.21
    written, MiB/s:               2.81

General statistics:
    total time:                          30.2897s
    total number of events:              30942

Latency (ms):
         min:                                    0.01
         avg:                                   37.83
         max:                                  347.34
         95th percentile:                      161.51
         sum:                              1170447.73

Threads fairness:
    events (avg/stddev):           793.3846/60.07
    execution time (avg/stddev):   30.0115/0.00