sysbenchOutputs/results_6_2G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 6
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      190.82
    writes/s:                     127.16
    fsyncs/s:                     429.58

Throughput:
    read, MiB/s:                  2.98
    written, MiB/s:               1.99

General statistics:
    total time:                          30.1888s
    total number of events:              21801

Latency (ms):
         min:                                    0.00
         avg:                                    8.26
         max:                                  170.57
         95th percentile:                       43.39
         sum:                               180006.73

Threads fairness:
    events (avg/stddev):           3633.5000/73.69
    execution time (avg/stddev):   30.0011/0.00