sysbenchOutputs/results_6_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 6
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      205.92
    writes/s:                     137.28
    fsyncs/s:                     460.67

Throughput:
    read, MiB/s:                  3.22
    written, MiB/s:               2.14

General statistics:
    total time:                          30.3003s
    total number of events:              23592

Latency (ms):
         min:                                    0.00
         avg:                                    7.64
         max:                                  135.96
         95th percentile:                       39.65
         sum:                               180210.57

Threads fairness:
    events (avg/stddev):           3932.0000/162.56
    execution time (avg/stddev):   30.0351/0.00