sysbenchOutputs/results_9_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 9
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 3.9062MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      202.14
    writes/s:                     134.93
    fsyncs/s:                     466.51

Throughput:
    read, MiB/s:                  3.16
    written, MiB/s:               2.11

General statistics:
    total time:                          30.2576s
    total number of events:              23165

Latency (ms):
         min:                                    0.00
         avg:                                   11.66
         max:                                  258.79
         95th percentile:                       58.92
         sum:                               270028.46

Threads fairness:
    events (avg/stddev):           2573.8889/131.54
    execution time (avg/stddev):   30.0032/0.00